<?php

namespace Database\Seeders;

use App\Models\Event;
use Encore\Admin\Facades\Admin;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GradesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $routes = [
            ['Категория' => '5', 'Кол-во' => 4, 'Ценность' => 100],
            ['Категория' => '5+', 'Кол-во' => 4, 'Ценность' => 150],
            ['Категория' => '6A', 'Кол-во' => 4, 'Ценность' => 200],
            ['Категория' => '6A+', 'Кол-во' => 3, 'Ценность' => 250],
            ['Категория' => '6B', 'Кол-во' => 3, 'Ценность' => 300],
            ['Категория' => '6B+', 'Кол-во' => 3, 'Ценность' => 350],
            ['Категория' => '6C', 'Кол-во' => 2, 'Ценность' => 400],
            ['Категория' => '6C+', 'Кол-во' => 1, 'Ценность' => 450],
            ['Категория' => '7A', 'Кол-во' => 1, 'Ценность' => 500],
            ['Категория' => '7A+', 'Кол-во' => 1, 'Ценность' => 550],
            ['Категория' => '7B', 'Кол-во' => 1, 'Ценность' => 600],
            ['Категория' => '7B+', 'Кол-во' => 1, 'Ценность' => 650],
            ['Категория' => '7C', 'Кол-во' => 1, 'Ценность' => 700],
            ['Категория' => '7C+', 'Кол-во' => 1, 'Ценность' => 750],
            ['Категория' => '8A', 'Кол-во' => 0, 'Ценность' => 800],
        ];
        for($i = 1; $i <= AdminRoleAndUsersSeeder::COUNT_EVENTS; $i++){
            Event::generation_route($i, $i, $routes);
        }


    }
}
