@extends('layouts.main_page.app')

@section('content')
    <section class="list-route">
                <div class="row mt-3 gy-4">
                    <div class="col">
                        <div class="container">
                            <div class="row">
                                <p>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</p>

                                <p>Вступает в силу с 1 июня 2024 года</p>

                                <p>Как владелец climbing-events.ru (“Сайт”), мы понимаем, что ваша конфиденциальность имеет решающее значение.
                                    Настоящая Политика конфиденциальности описывает, какую информацию мы собираем от вас через Сайт, а также как
                                    мы используем и раскрываем такую информацию.</p>

                                <p>ИСПОЛЬЗОВАНИЕ ФАЙЛОВ COOKIE</p>

                                <p>Файл cookie-это файл, содержащий идентификатор (строку букв и цифр), который отправляется веб-сервером в
                                    веб-браузер и хранится в нем. Затем идентификатор отправляется обратно на сервер каждый раз, когда браузер
                                    запрашивает страницу с сервера. Куки-файлы могут быть либо “постоянными” куки-файлами, либо “сессионными”
                                    куки-файлами: постоянные куки-файлы будут храниться веб-браузером и будут оставаться действительными до
                                    установленного срока их действия, если только пользователь не удалит их до истечения срока действия;
                                    сессионные куки-файлы, с другой стороны, истекут в конце сеанса пользователя, когда веб-браузер будет
                                    закрыт. Файлы cookie обычно не содержат никакой информации, которая лично идентифицирует пользователя, но
                                    личная информация, которую мы храним о вас, может быть связана с информацией, хранящейся в файлах cookie и
                                    полученной из них.</p>

                                <p>Мы используем файлы cookie для следующих целей:</p>

                                <p>(а) аутентификация – мы используем файлы cookie для идентификации вас, когда вы посещаете наш веб-сайт и
                                    когда вы перемещаетесь по нашему веб-сайту;</p>

                                <p>(b) статус – мы используем файлы cookie чтобы помочь нам определить, вошли ли вы на наш веб-сайт;</p>

                                <p>(c) персонализация – мы используем файлы cookie[для хранения информации о ваших предпочтениях и
                                    персонализации веб-сайта для вас;</p>

                                <p>(d) безопасность – мы используем файлы cookie как элемент мер безопасности, используемых для защиты учетных
                                    записей пользователей, включая предотвращение мошеннического использования учетных данных для входа, а также
                                    для защиты нашего веб-сайта и услуг в целом;</p>

                                <p>(e) реклама – мы используем файлы cookie для того, чтобы помочь нам показывать рекламу, которая будет иметь
                                    отношение к вам и;</p>

                                <p>(f) анализ – мы используем файлы cookie чтобы помочь нам проанализировать использование и производительность
                                    нашего веб-сайта и услуг;</p>

                                <p>Большинство браузеров позволяют вам отказываться принимать файлы cookie и удалять их. Методы для этого
                                    варьируются от браузера к браузеру и от версии к версии. Однако вы можете получить актуальную информацию о
                                    блокировке и удалении файлов cookie по этим ссылкам:</p>

                                <p>а) https://support.google.com/chrome/answer/95647?hl=en (Chrome);</p>

                                <p>(б) https://support.mozilla.org/en-US/kb/enable-and-disable-cookies-website-preferences(в Firefox);</p>

                                <p>с) http://www.opera.com/help/tutorials/security/cookies/ (Opera);</p>

                                <p>(д) https://support.microsoft.com/en-gb/help/17442/windows-internet-explorer-delete-manage-cookies
                                    (интернет-обозреватель);</p>

                                <p>e) https://support.apple.com/kb/PH21411 (Safari); и</p>

                                <p>(f) https://privacy.microsoft.com/en-us/windows-10-microsoft-edge-and-privacy (edge)</p>

                                <p>.</p>

                                <p>Обратите внимание, что блокировка файлов cookie может негативно сказаться на функциях многих веб-сайтов,
                                    включая наш сайт. Некоторые функции Сайта могут перестать быть вам доступны.</p>

                                <p>АДРЕСА ЭЛЕКТРОННОЙ ПОЧТЫ</p>

                                <p>Мы можем получить ваш адрес электронной почты, но только в том случае, если вы добровольно предоставите его
                                    нам. Это может произойти, например, если вы подписываетесь на рассылку новостей по электронной почте или
                                    участвуете в акции. Мы будем использовать ваш адрес электронной почты для целей, для которых вы его нам
                                    предоставили, а также время от времени отправлять вам электронные письма, касающиеся Сайта или других
                                    продуктов или услуг, которые, по нашему мнению, могут представлять для вас интерес. Вы можете отказаться от
                                    таких сообщений электронной почты в любое время, нажав кнопку “отписаться” в письме.</p>

                                <p>Ваш адрес электронной почты также может быть передан поставщику технологий, который мы используем в связи с
                                    целями, для которых вы его предоставили, и этот поставщик технологий также может время от времени
                                    связываться с вами.</p>

                                <p>РЕГИСТРАЦИОННЫЕ ИЛИ УЧЕТНЫЕ ДАННЫЕ</p>

                                <p>Когда вы используете Сайт, мы можем собирать другие данные, которые вы предоставляете добровольно (например,
                                    комментарии, которые вы публикуете).</p>

                                <p>Мы можем использовать вашу личную информацию для различных наших внутренних деловых целей, таких как создание
                                    лучшего пользовательского опыта для Сайта, диагностика и устранение неисправностей на Сайте, лучшее
                                    понимание того, как используется Сайт, и предоставление вам персонализированных рекомендаций.</p>

                                <p>Если вы считаете, что наша обработка вашей личной информации нарушает законы о защите данных, вы имеете
                                    законное право подать жалобу в надзорный орган, ответственный за защиту данных.</p>

                                <p>Вы можете воспользоваться любыми своими правами в отношении ваших персональных данных, направив нам
                                    письменное уведомление по адресу: admin@climbing-events.ru</p>

                                <p>ИЗМЕНЕНИЯ В ПОЛИТИКЕ КОНФИДЕНЦИАЛЬНОСТИ</p>

                                <p>Мы можем время от времени изменять настоящую Политику конфиденциальности. Самая последняя версия Политики
                                    конфиденциальности всегда будет размещена на Сайте, а “Дата вступления в силу” - в верхней части Политики.
                                    Мы можем пересматривать и обновлять настоящую Политику конфиденциальности, если наша практика меняется по
                                    мере изменения технологий, добавления новых услуг или изменения существующих. Если мы внесем какие-либо
                                    существенные изменения в нашу Политику конфиденциальности или в то, как мы обрабатываем вашу личную
                                    информацию, или мы собираемся использовать любую личную информацию способом, существенно отличающимся от
                                    того, который указан в нашей Политике конфиденциальности на момент сбора такой информации, мы предоставим
                                    вам разумную возможность дать согласие на это изменение. Если вы не дадите своего согласия, ваша личная
                                    информация будет использоваться в соответствии с условиями политики конфиденциальности, действовавшей на
                                    момент получения нами этой информации. Используя наш Сайт или услуги после Даты вступления в силу, вы
                                    соглашаетесь с нашей действующей на тот момент политикой конфиденциальности. Мы будем использовать
                                    информацию, ранее полученную в соответствии с Политикой конфиденциальности, действующей на момент получения
                                    этой информации от вас.</p>

                                <p>СВЯЖИТЕСЬ С НАМИ</p>

                                <p>Если у вас есть какие-либо вопросы об этой Политике конфиденциальности или практике работы этого Сайта,
                                    пожалуйста, свяжитесь с нами через нашу контактную страницу.</p>
                            </div>
                        </div>
                    </div>
                </div>
            </section>
@endsection
