<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

class Color extends Model
{
        const colors = [
            '#FFFFFF' => 'Белый',
            '#40E0D0' => 'Бирюзовый',
            '#FF1493' => 'Горячий розовый',
            '#FFD700' => 'Золотой',
            '#FFFF00' => 'Жёлтый',
            '#ADFF2F' => 'Зелёный жёлтый',
            '#008000' => 'Зелёный',
            '#32CD32' => 'Лаймовый зелёный',
            '#00FF00' => 'Лаймовый',
            '#E6E6FA' => 'Лаванда',
            '#FF00FF' => 'Фуксия',
            '#C71585' => 'Малиновый',
            '#00FA9A' => 'Морской зелёный',
            '#800000' => 'Коричневый',
            '#8A2BE2' => 'Синевато-фиолетовый',
            '#0000FF' => 'Синий',
            '#A020F0' => 'Фиолетовый',
            '#808000' => 'Оливковый',
            '#6B8E23' => 'Оливковый зелёный',
            '#FF4500' => 'Оранжевый',
            '#FFC0CB' => 'Розовый',
            '#FF0000' => 'Красный',
            '#DDA0DD' => 'Пастельный фиолетовый',
            '#F4A460' => 'Светло-коричневый',
            '#B0C4DE' => 'Светло-голубой',
            '#D3D3D3' => 'Светло-серый',
            '#F5F5F5' => 'Светло-серый белый',
            '#C0C0C0' => 'Серебристый',
            '#808080' => 'Серый',
            '#4682B4' => 'Стальной синий',
            '#D2691E' => 'Шоколадный',
            '#F0E68C' => 'Хаки',
            '#000000' => 'Чёрный',
            '#00FFFF' => 'Циан',
            '#FF6347' => 'Томатный',
            '#00008B' => 'Тёмно-синий',
            '#006400' => 'Тёмно-зелёный',
            '#A9A9A9' => 'Тёмно-серый',
            '#BDB76B' => 'Тёмно-зелёный оливковый',
            '#F5DEB3' => 'Пшеничный',
            '#8B4513' => 'Сэд',
            '#DCDCDC' => 'Очень светло-серый'
        ];
public function event()
    {
        return $this->belongsTo(Event::class)->where('active', 1);
    }
}
